# without git there is nothing
brew "git"

# utils
brew "coreutils"
brew "moreutils"
brew "findutils"

# shells and editors
brew "bash"
brew "zsh"
brew "neovim"
brew "vim", args: ["override-system-vi", "with-lua"]

# command line tools
brew "grep"
brew "fzf"
brew "gnu-sed", args: ["default-namesinstall"]
brew "gnupg2"
brew "jq"
brew "pass"
brew "reattach-to-user-namespace", args: ["wrap-pbcopy-pbpaste"]
brew "tree"
brew "tmux"
brew "unar"
brew "vimpager"
brew "wget", args: ["enable-iri"]
brew "youtube-dl"

# compilers. this will take a while
# brew ghc
brew "node"
brew "python"
brew "r"

cask "bitwarden"
cask "calibre"
cask "firefox"
cask "google-chrome"
cask "karabiner-elements"
cask "mullvad-vpn"
cask "musicbrainz-picard"
cask "obsidian"
cask "openemu"
cask "reaper"
cask "resilio-sync"
cask "ticktick"
cask "vlc"

# cask fonts
cask "font-inconsolata-dz-for-powerline"
