# without git there is nothing
brew "git"

# utils
brew "coreutils"
brew "moreutils"
brew "findutils"

# shells and editors
brew "bash"
brew "zsh"
brew "neovim"
brew "vim", args: ["override-system-vi", "with-lua"]

# command line tools
brew "ag"
brew "grep"
brew "fzf"
brew "gnu-sed", args: ["default-namesinstall"]
brew "gnupg2"
brew "hub"
brew "jq"
brew "pass"
brew "reattach-to-user-namespace", args: ["wrap-pbcopy-pbpaste"]
brew "tree"
brew "tmux"
brew "unar"
brew "vimpager"
brew "wget", args: ["enable-iri"]
brew "youtube-dl"

# compilers. this will take a while
# brew ghc
brew "node"
brew "python3"
brew "r"

# cask apps
cask_args appdir: "/Applications"

cask "ableton-live-suite"
cask "calibre"
cask "dropbox"
cask "dash"
cask "firefox"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2-beta"
cask "karabiner-elements"
cask "openemu"
cask "private-internet-access"
cask "splice"
cask "steam"
cask "tor-browser"
cask "vlc"

# cask fonts
cask "font-inconsolata-dz-for-powerline"
