# without git there is nothing
brew "git"

# taps
tap "homebrew/science"
tap "homebrew/versions"
tap "homebrew/python"
tap "thoughtbot/formulae"

# utils
brew "coreutils"
brew "moreutils"
brew "findutils"

# shells and editors
brew "bash"
brew "zsh"
brew "neovim"
brew "vim", args: ["override-system-vi", "with-lua"]

# command line tools
brew "ag"
brew "grep"
brew "fzf"
brew "gnu-sed", args: ["default-namesinstall"]
brew "gnupg2"
brew "hub"
brew "jq"
brew "numpy"
brew "pass"
brew "reattach-to-user-namespace", args: ["wrap-pbcopy-pbpaste"]
brew "scipy"
brew "tree"
brew "tmux"
brew "unar"
brew "vimpager"
brew "wget", args: ["enable-iri"]
brew "youtube-dl"

# compilers. this will take a while
# brew ghc
brew "pyenv"
brew "python3"
brew "r"

# cask apps
tap "caskroom/versions"
cask_args appdir: "/Applications"

cask "atom"
cask "calibre"
cask "colloquy"
cask "disk-inventory-x"
cask "dropbox"
cask "dash"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2-beta"
cask "private-internet-access"
cask "slack"
cask "vlc"
mas "Reeder", id: 88001334

# cask fonts
tap "caskroom/fonts"
cask "font-inconsolata-dz-for-powerline"
